[
  "shortcuts-extender",
  "highlightr-plugin",
  "obsidian-enhancing-export",
  "convert-url-to-iframe",
  "obsidian-markdown-formatting-assistant-plugin",
  "colored-tags",
  "obsidian-enhancing-mindmap",
  "various-complements",
  "url-into-selection",
  "note-refactor-obsidian",
  "hotkeysplus-obsidian",
  "obsidian-pandoc",
  "obsidian-pandoc-reference-list",
  "text-snippets-obsidian",
  "obsidian-advanced-slides",
  "table-editor-obsidian",
  "obsidian-annotator",
  "obsidian-auto-link-title",
  "breadcrumbs",
  "calendar",
  "dataview",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-excalidraw-plugin",
  "excalibrain",
  "execute-code",
  "homepage",
  "obsidian-markmind",
  "metadata-menu",
  "multi-column-markdown",
  "omnisearch",
  "recent-files-obsidian",
  "review-obsidian",
  "simple-canvasearch",
  "templater-obsidian",
  "text-extractor",
  "obsidian-textgenerator-plugin",
  "obsidian-outliner",
  "cm-typewriter-scroll-obsidian"
]