[
  "shortcuts-extender",
  "highlightr-plugin",
  "obsidian-enhancing-export",
  "convert-url-to-iframe",
  "obsidian-markdown-formatting-assistant-plugin",
  "colored-tags",
  "obsidian-enhancing-mindmap",
  "various-complements",
  "url-into-selection",
  "note-refactor-obsidian",
  "hotkeysplus-obsidian",
  "obsidian-pandoc",
  "obsidian-pandoc-reference-list",
  "text-snippets-obsidian"
]